// sutras/dsqj-s.js

registerSutra("dsqj-s", {
  title: "无能胜大明王大随求陀罗尼经",
  displayTitle: "大随求陀罗尼经（简体）",
  abbr: "dsqj",
  category: "ddsqj",
  lang: "简体",
  volume: "全本",

  content: `无能胜大明王大随求陀罗尼经

净三业真言
唵。娑嚩婆嚩秫驮。娑嚩达摩。娑嚩婆嚩秫度憾。

南无本师释迦牟尼佛
南无本师释迦牟尼佛
南无本师释迦牟尼佛

开经偈
无上甚深微妙法。百千万劫难遭遇。
我今见闻得受持。愿解如来真实义。

普遍光明清净炽盛如意宝印心无能胜大明王大随求陀罗尼经卷上
唐北天竺三藏沙门大广智不空奉诏译

大随求陀罗尼经序品第一
如是我闻。一时婆伽梵。住大金刚须弥卢峯楼阁。安住大金刚三摩地。以大金刚庄严劫树于大金刚池宝莲花光照。金刚沙而布于地。于大金刚加持。金刚道场天帝释宫殿。以俱胝那庾多百千庄严大金刚师子之座。说法神通处。一切如来神力之所加持。入一切法平等出生萨婆若智。与八十四俱胝那庾多菩萨众俱。皆是一生补处。于阿耨多罗三藐三菩提得不退转。皆得大势。皆悉示现大金刚解脱三摩地佛刹神通。于刹那间随入一切有情心行。成就种种美妙广大甚深巧说诸法。辩才无碍得大神通。悉能供养无量佛世界如来。大供养云海解脱三摩地自在神通。不共觉分道支一切地波罗蜜。善巧四摄慈悲喜舍力远离清净心相续中。其名曰。

金刚藏菩萨摩诃萨。金刚眼菩萨摩诃萨。金刚身菩萨摩诃萨。金刚慧菩萨摩诃萨。金刚手菩萨摩诃萨。金刚相击菩萨摩诃萨金刚那罗延菩萨摩诃萨。金刚游戏菩萨摩诃萨。金刚积菩萨摩诃萨。金刚髻菩萨摩诃萨。金刚妙菩萨摩诃萨。金刚幢菩萨摩诃萨。

如是上首菩萨摩诃萨众俱。

复与大声闻众皆大阿罗汉。断除有结尽一切漏。得善正知。心善解脱。悉能现不思议神通力。神境通游戏。皆得大势。于见无著。离一切垢。焚烧习气种。其名曰具寿舍利子。具寿满慈子。具寿劫宾那。具寿须菩提。具寿迦叶波。具寿大迦叶波。具寿优楼频螺迦叶波。与如是等上首大声闻众俱。复有大自在天子为上首。与无量无边不可说阿僧祇净居天子众俱。

复有娑诃世界主大梵天王为上首。与梵众天子俱。

复有苏夜摩天子化乐天子他化自在天子。及天帝释各与诸天子以为眷属俱。

复有毘摩质多罗阿苏罗王。末离阿苏罗王。令欢喜阿苏罗王。照曜阿苏罗王。罗睺阿苏罗王。如是上首阿苏罗王。与无量无边阿苏罗王以为眷属俱。

复有娑伽罗龙王。德叉迦龙王。嚩苏枳龙王。商佉波罗龙王。羯句咤迦龙王。莲华龙王。大莲华龙王。如是等上首龙王。与无量无边阿僧祇龙王众俱。

复有树紧那罗王。与无量紧那罗王眷属俱。

复有一切义成就持明仙王。与无量持明仙王眷属俱。

复有五髻乾闼婆王。与无量乾闼婆王眷属俱。

复有金银蘖路茶王。与无量蘖路茶王眷属俱。

复有多闻药叉王。宝贤药叉王。满贤药叉王。半支迦药叉王。与无量无边药叉王眷属俱。

复有诃利帝母。与五百子以为眷属俱。复有七护世母天。七大罗刹母。游虚空七仙天。九执曜天。方隅地天。辩才天女名与眷属俱。

复有作障者毘那夜迦。并毕隷多。部多。一切皆是大威德者。各与眷属俱。

复有一切山王。一切海王及护世王水天。并持国天王。增长天王。恶目天王。持棒罗刹主七风天伊舍那天并及其后。与千俱胝那庾多眷属俱。

复有那罗延天。与眷属俱。

复有捺多迦那么迦。噜贺迦。大伽那钵底。弥瞿罗迦如是等毘那夜迦王。与无量无边毘那夜迦以为眷属俱。

复有六十游行诸城堡王与眷属俱。

复有四姊妹女天并兄。以为眷属俱。

复有金刚商羯罗女。与六十四金刚女以为眷属俱。

复有金刚军童子。苏摩呼童子。顶行童子。与无量金刚族以为眷属俱。

复有净信佛法僧。天龙药叉乾闼婆阿苏罗蘖路茶。紧那罗摩户罗伽部多。毕舍遮。阿钵娑么囉。嗢摩那娑𠆙娑。呬里迦。乌萨多罗迦并日月天子。晨朝天。日午天。黄昏天。中夜天。及一切时天。与无量无边阿僧祇眷属俱。于是世尊善转法轮佛事已终。福德智慧究竟圆满。善摄受一切智大菩提。获得炽盛地波罗蜜。以三十二大丈夫相庄严法身。八十四随好庄严一切支分。一切有情无所观顶相。超胜一切魔罗。通达一切智智。具足五眼。一切相成就。一切智智成就。一切佛法成就。摧一切魔异论。高显名称大雄猛师子吼。坏无明黑闇。以无量无边阿僧祇百千俱胝那庾多劫之所积集。施戒忍勤勇静虑般若方便愿力智波罗蜜难行苦行。转得三十二大人相八十四随好庄严。其身坐大宝金刚莲华藏师子之座。其座以无量金刚宝珠罗网庄严。微风摇击出妙音声。以无量金刚界安住神足。以无量金刚宝庄严。摩竭口吐于赤珠。复含在口。以无量宝严饰莲花蕊。虎珀大虎珀。帝青大帝青。补沙罗伽。庄严光网普遍端严。以无量金刚宝庄严幰盖柄。以无量俱胝那庾多百千劫树。荫影庄严。其座广博大如须弥。犹如金山。吉祥炽盛光明庄严。照过千日。其地圆满犹如净月。令诸有情深所乐见如来之法。如大劫树其花开敷。所说妙法初中后善。其义深远其语巧妙。清净洁白纯一无杂。

尔时。世尊从顶毫相。放大光明，其光名曰现一切如来光网。由此光明。普照三千大千世界乃至如恒河沙数佛世界。于彼世界所有如来。于大庄严楼阁无量宝庄严师子座上说法。并一切菩萨及大声闻苾刍苾刍尼净信男净信女。天龙药叉乾闼婆阿苏罗蘖路茶紧那罗摩户罗伽。悉皆照曜显现分明。尔时世尊普为一切说伽陀曰。

我今说随求。愍念诸有情。此大陀罗尼。能摧难调者。
诸极恶重罪。若得才闻此。随求陀罗尼。一切罪消灭。
安乐诸有情。解脱一切病。大悲众生故。是故世尊说。
为获解脱故。远离诸恶趣。若入修罗宫。药叉罗刹宫。
步多龙鬼神。如是诸宫殿。随意悉能入。皆用此大明。
而作于加护。斗战危险处。不被怨沮坏。并诸鬼魅等。
由称陀罗尼。诸魅悉坏灭。娑謇嗢未那。毕舍拏吉你。
猛恶吸精气。常害有情类。彼皆悉殄灭。由随求灭德。
他敌皆灭坏。所作剧厌祷。咒诅法无效。定业不受报。
不被蛊毒中。水火及刀杖。雷电与霜雹。黑风恶暴雨。
诸难皆得脱。冤敌悉降伏。若人持此明。或带于颈臂。
所求愿悉成。一切所希愿。悉皆得如意。天王皆加护。
及诸大龙王。菩萨大勤勇。缘觉及声闻。一切诸如来。
明妃大威德。悉皆而拥护。受持随求者。金刚秘密主。
护世四天王。于彼持诵人。昼夜常加护。帝释忉利众。
梵王毘纽天。及摩酰首罗。众生俱摩罗。大黑喜自在。
一切天母众。及余诸魔众。苦行威德仙。及余密语天。
皆悉来拥护。持此随求者。大威德菩萨。明妃大悲尊。
勇猛具神力。摩摩毘俱胝。多罗央俱尸。及余金刚锁。
白衣及太白。圣摩诃迦离。使者金刚使。妙索金刚索。
执轮大力者。金刚鬘大明。甘露军咤利。无能胜明妃。
黑耳吉祥天。大福威德尊。莲花军咤利。花齿及珠髻。
金发宾蘖罗。大威德吉祥。及电庄严天。一髻大罗刹。
及佛地护尊。迦波利明女。楞伽自在尊。及余多类众。
彼等皆拥护。由大明在手。诃利帝及子。半支迦大将。
商弃尼积齿。吉祥及辩才。由持此密言。昼夜常随逐。
若有诸女人。持此陀罗尼。彼皆悉成就。男女在其胎。
安隐胎增长。产生皆安乐。一切病悉除。诸罪皆消灭。
福力常具足。谷麦及财宝。悉皆得增长。出言令乐闻。
所至获恭敬。男子及女人。清净能受持。常怀慈悲心。
拔济诸有情。皆愿获安乐。令彼离疾病。国王并后宫。
皆生恭敬心。吉祥常炽盛。福聚皆增长。一切真言法。
皆悉得成就。成入一切坛。得成三昧耶。如来诚实说。
恶梦不能侵。诸罪悉除灭。烦恼及怨敌。执曜灾祸灭。
大智自在说。能满他愿欲。是故我今说。大众咸谛听。

曩谟萨嚩怛他誐跢南。曩谟曩莫。萨嚩没驮冐地萨多嚩。没驮达摩僧契毘药。唵。尾补攞蘖陛。尾补攞尾么黎。惹野蘖陛。嚩日囉入嚩攞蘖陛。誐底誐贺宁。誐誐曩尾戍陀宁。萨嚩播跛尾戍陀宁。唵。。虞拏嚩底。誐誐哩抳。拟哩拟哩。誐么哩誐么哩。虐贺虐贺。蘖誐哩蘖誐哩。誐誐哩誐誐哩。俨婆哩俨婆哩。誐底誐底。誐么𩕳誐㘑。虞噜虞噜。虞噜抳。佐黎。阿佐黎。母佐黎。惹曳。。尾惹曳。萨嚩婆野尾誐帝。蘖婆三婆囉抳。悉哩悉哩。弭哩弭哩。岐哩岐哩。三满跢迦囉洒抳。萨嚩设咄噜钵罗末他𩕳。囉吃洒囉吃洒么么（某甲）萨嚩萨多嚩难佐。尾哩尾哩。尾誐跢嚩囉拏。婆野曩舍𩕳。苏哩苏哩。唧哩剑么黎。尾么黎。惹曳。尾惹曳。惹夜嚩奚。惹野嚩底。婆誐嚩底囉怛曩么矩咤么逻驮哩。么护尾尾驮尾唧怛囉。吠洒噜跛驮哩抳。婆誐嚩底摩贺尾你也埿尾。囉吃洒囉吃洒么么（某甲）萨嚩萨多嚩难佐。三满跢萨嚩怛囉。萨嚩播跛尾戍驮𩕳。户噜户噜。诺乞察怛囉么逻驮哩抳。囉吃洒囉吃洒𤚥么么（某甲）阿曩他写。。怛囉拏跛囉耶拏写。跛哩谟佐野冥。萨嚩耨契毘药。战尼战尼。战腻𩕳吠誐嚩底。萨嚩讷瑟咤𩕳嚩囉抳。设咄噜博吃叉钵囉末他𩕳。尾惹野嚩呬𩕳。户噜户噜。母噜母噜。祖噜祖噜。。阿欲播攞𩕳。苏囉嚩囉末陀𩕳。萨嚩泥嚩跢布呲帝。地哩地哩。三满跢嚩路枳帝。钵囉陛钵囉陛。苏钵囉婆尾秫第。萨嚩播跛尾戍驮宁。达囉达囉。达囉抳驮囉达㘑。苏母苏母。噜噜佐黎。佐攞耶努瑟鹐。布囉野铭阿苫。室哩嚩补陀难惹野剑么黎。吃史抳吃史抳。嚩囉泥嚩囉能矩势。唵钵纳么尾第。戍驮野戍驮野。舜第。。跛囉跛囉。鼻哩鼻哩。步噜步噜。懵誐攞尾舜第。跛尾怛囉穆弃。渴拟抳渴拟抳。。佉囉佉囉。入嚩里多始渴㘑。三满多钵囉娑哩跢嚩婆悉多第。入嚩攞入嚩攞萨嚩泥嚩誐拏三么迦囉洒抳。萨底也嚩帝跢囉怛囉哆哩野𤚥。曩誐尾𡀔枳帝。攞护攞护。户弩户弩。乞史抳乞史抳。萨嚩拟囉贺薄乞洒抳。冰誐里冰誐里。祖母祖母。苏母苏母。祖母佐㘑。多囉多囉。曩誐尾路枳𩕳跢囉野睹𤚥。婆誐嚩底阿瑟咤摩贺婆曳毘药。三闷捺囉娑誐囉钵哩演担。播跢罗誐誐曩怛览萨嚩怛囉。三满帝曩你舍满第曩。嚩日囉钵囉迦囉嚩日囉播舍满弹宁曩。嚩日囉入嚩罗尾秫第。步哩步哩。蘖婆嚩底蘖婆尾戍驮𩕳。锔吃史三布囉抳。入嚩罗入嚩罗。佐罗佐罗。入嚩里𩕳钵囉袜洒睹泥嚩。三满帝曩你眇娜计曩。阿蜜栗多嚩囉洒抳。泥嚩跢嚩跢囉抳。阿鼻诜者睹铭。苏誐多嚩囉嚩佐曩蜜栗多。嚩囉嚩补晒囉吃洒囉吃洒么么（某甲）。萨嚩萨多嚩难佐。萨嚩怛囉萨嚩娜萨婆曳毘药。萨冐钵捺囉吠毘药。萨冐跛僧霓毘药。萨嚩讷瑟咤婆野鼻怛写。萨嚩迦里迦攞贺尾蘖囉贺尾嚩娜耨萨嚩跛难。讷𩕳弭跢瞢誐罗播跛尾曩舍𩕳。萨嚩药吃叉囉吃洒娑。曩誐𩕳嚩囉抳萨囉抳娑㘑。么攞么攞。。么攞嚩底。。惹野惹野惹野睹𤚥。萨嚩怛囉萨嚩迦览。悉钿睹铭曀𤚥摩贺尾捻娑陀野娑陀野。萨嚩曼拏攞娑陀𩕳。伽多野萨嚩尾觐曩。惹野惹野。悉递悉递苏悉递。悉地野悉地野。没地野没地野。布囉野布囉野。布囉抳布囉抳。布囉野阿苫。萨嚩尾你也地誐多没帝。惹愈多哩惹夜嚩底。底瑟咤底瑟咤。三么野么拏播攞野。怛他蘖多纥哩乃野舜第弭也嚩路迦野𤚥。阿瑟咤鼻摩贺娜噜拏婆裳。萨囉萨囉。钵囉萨囉钵囉萨囉。萨嚩嚩囉拏尾戍陀𩕳。三满跢迦囉曼拏攞尾舜第。尾誐帝尾誐帝。尾誐多么攞尾戍陀𩕳。乞史抳乞史抳。萨嚩播跛尾舜第。么攞尾蘖帝。帝惹嚩底嚩日囉嚩底怛𡃤路枳野地瑟耻帝娑嚩贺。萨嚩怛他蘖多没驮毘色讫帝娑嚩贺。萨嚩冐地萨多嚩毘色讫帝娑嚩贺。萨嚩泥嚩跢毘色讫帝娑嚩贺。萨嚩怛他誐多纥哩乃夜地瑟耻多纥哩乃曳娑嚩贺。萨嚩怛他誐多三么野悉第娑嚩贺。印捺㘑印捺攞嚩底印捺囉弭也嚩路枳帝娑嚩贺。没囉憾铭波囉憾么底庾史帝娑嚩贺。尾瑟弩曩莫塞讫哩帝娑嚩贺。摩系湿嚩囉满你多布尔跢曳娑嚩贺。嚩日囉陀囉嚩日囉播抳么攞尾哩野地瑟耻帝娑嚩贺。地𠴊多囉瑟咤囉野萨嚩贺。尾噜茶迦野萨嚩贺。尾噜播吃洒野萨嚩贺。吠室囉摩拏野萨嚩贺拶咄摩贺囉惹曩莫塞讫哩多野萨嚩贺。焰么野萨嚩贺。焰么布尔多曩莫塞讫哩跢野萨嚩贺。嚩噜拏野萨嚩贺。么噜哆野萨嚩贺。。摩贺么噜跢野萨嚩贺。阿𭉆曩曳萨嚩贺。曩誐尾路枳跢野萨嚩贺。泥嚩誐奶毘药萨嚩贺。曩誐誐奶毘药萨嚩贺。药乞洒誐奶毘药萨嚩贺。囉乞洒娑誐奶毘药萨嚩贺。彦闼嚩誐奶毘药娑嚩贺。阿苏囉誐奶毘药萨嚩贺。誐噜拏誐奶毘药萨嚩贺。紧捺囉誐奶毘药萨嚩贺。摩护囉誐奶毘药萨嚩贺。么努晒毘药萨嚩贺。阿么努晒毘药萨嚩贺。萨嚩蘖囉系毘药萨嚩贺。萨嚩步帝毘药萨嚩贺。必哩帝毘药萨嚩贺。比舍际毘药萨嚩贺。阿跛娑么隷毘药萨嚩贺。禁畔奶毘药萨嚩贺。唵度噜度噜萨嚩贺。唵睹噜睹噜萨嚩贺。唵亩噜亩噜萨嚩贺。贺曩贺曩萨嚩设睹噜喃萨嚩贺。娜贺娜贺萨嚩讷瑟咤钵囉纳瑟咤喃萨嚩贺。钵佐钵佐萨嚩钵囉底也剔迦钵囉底也弭怛囉喃。曳么么阿呬帝史拏入帝衫萨吠衫舍哩囕入嚩攞野讷瑟咤唧哆喃萨嚩贺。入嚩里哆野萨嚩贺。钵囉入嚩里哆野萨嚩贺。你跛多入嚩攞野萨嚩贺。三满多入嚩攞野萨嚩贺。么抳跋捺囉野萨嚩贺。布罗拏跛捺囉野萨嚩贺。摩贺迦囉野萨嚩贺。么底哩誐拏野萨嚩贺。也吃史抳喃萨嚩贺。囉吃洒枲喃萨嚩贺。阿迦舍么底哩喃萨嚩贺。三亩捺囉嚩枲𩕳喃萨嚩贺。囉底哩拶囉喃萨嚩贺。你嚩娑拶囉喃萨嚩贺。底哩散𠆙拶囉喃萨嚩贺。尾攞拶囉喃萨嚩贺。阿尾逻拶囉喃萨嚩贺。蘖婆贺𭋸毘药萨嚩贺。蘖婆散跢囉抳萨嚩贺。户噜户噜萨嚩贺。唵萨嚩贺。萨嚩萨嚩贺。扑萨嚩贺。步嚩萨嚩贺。唵部囉步嚩娑嚩萨嚩贺。唧征唧征萨嚩贺。尾微尾微萨嚩贺。驮囉抳萨嚩贺。驮囉抳萨嚩贺。阿𭉆𩕳萨嚩贺。帝祖嚩补萨嚩贺。唧里唧里萨嚩贺。悉里悉里萨嚩贺。没𠆙没𠆙萨嚩贺。悉𠆙悉𠆙萨嚩贺。曼拏攞悉第萨嚩贺。曼拏攞满第萨嚩贺。枲么满陀𩕳萨嚩贺。萨嚩设咄噜喃渐婆渐婆萨嚩贺。娑瞻婆野娑瞻婆野萨嚩贺。亲娜亲娜萨嚩贺。牝娜牝娜萨嚩贺。畔惹畔惹萨嚩贺。满驮满驮萨嚩贺。莽贺野莽贺野萨嚩贺。么抳尾舜第萨嚩贺。素哩曳素哩曳素哩野尾舜第尾戍驮𩕳娑嚩贺。战涅𭋸素战涅𭋸布囉拏战涅𭋸萨嚩贺。蘖囉系毘药萨嚩贺。诺吃察底𭋸毘药萨嚩贺。始吠萨嚩贺。扇底萨嚩贺。萨嚩娑底也野宁萨嚩贺。始鑁羯哩扇底羯哩补瑟置羯哩么罗末达𩕳萨嚩贺。室哩羯哩萨嚩贺。室哩野末达𩕳萨嚩贺。室哩野入嚩攞𩕳萨嚩贺。曩母呰萨嚩贺。么噜呰萨嚩贺。吠誐嚩底萨嚩贺。唵萨嚩怛他誐多没帝钵囉嚩囉尾誐多婆曳舍么野萨嚩铭婆誐嚩底萨嚩播闭毘喻娑嚩娑底婆嚩睹。母𩕳母𩕳。尾母𩕳佐𭋸佐攞宁婆野尾誐帝婆野贺囉抳。冐地冐地。冐驮野冐驮野。没地里没地里。萨嚩怛他誐多纥里乃野足瑟𪘜萨嚩贺。唵嚩日罗嚩底嚩日囉钵囉底瑟耻帝舜第。怛他誐多母捺囉地瑟咤曩地瑟耻帝萨嚩贺。唵亩𩕳亩𩕳。亩𩕳嚩𭋸阿鼻诜佐睹𤚥。萨嚩怛他蘖跢萨嚩尾你也鼻晒罽。摩贺嚩日囉迦嚩佐母捺囉母捺哩带。萨嚩怛他誐多吃哩乃夜地瑟耻多嚩日𭋹娑嚩贺。

尔时婆伽梵说此普遍光明清净炽盛如意宝印心无能胜大明王随求大陀罗尼已。告大梵等言。大梵若有善男子善女人。若才闻此陀罗尼者。所有一切罪障悉皆消灭。若能读诵受持在心。当知是人即是金刚坚固之身。火不能烧刀不能害。毒不能中。大梵云何得知火不能烧。于迦毘罗大城罗睺罗童子在母胎时。其母释种女耶输陀罗。被掷火坑。于是罗睺罗在母胎中。忆念此陀罗尼。其大火坑便自清冷。寻即变成莲华之池。何以故此陀罗尼是一切如来加持力故。大梵当知以是因缘火不能烧。复次大梵毒不能害者。如善游城丰才长者子持诵世天所说密言。以持明力故钩召德叉迦龙王。忘不结界护身。其龙瞋怒啮损。是人受大苦痛命将欲绝。多有诸持明者无能救济。于其城中有一优婆夷名曰无垢清净。常诵持此随求大明陀罗尼。其优婆夷大悲成就。起悲愍心往诣其所。以此陀罗尼加持。才经一遍。其毒消灭平复如故。时长者子于无垢清净所。受此陀罗尼。忆念在心。大梵当知毒不能害。

复次。大梵筏罗捺斯城有王。名曰梵施。时隣国王有大威力。起四种兵来罚梵施。梵施辅佐白大王言。大王今被他敌夺王城邑。王当令我作何谋计却彼怨敌。是时梵施告群臣言。汝等今者勿生怱遽。我有随求大明王陀罗尼。由此陀罗尼威力。能摧他敌令如灰烬。时诸群臣即便稽首。白言大王我等臣下曾所未闻。王复告言汝等今者即见效验。其时梵施即以香水沐浴著新净衣。依法书写此陀罗尼。入在于箧。安头髻中。以此大随求陀罗尼。护身被甲即往入阵。王独共战四兵降伏来归梵施。大梵当知此大随求无能胜陀罗尼。是一切如来心印之所加持。有大神验。汝当受持。当知此陀罗尼等同诸佛。于后末法之时。短命薄福无福不修福者。如斯有情作利益故。大梵此大随求陀罗尼。依法书写系于臂上及在颈下。当知是人是一切如来之所加持。当知是人等同一切如来身。当知是人是金刚坚固之身。当知是人是一切如来藏身。当知是人是一切如来眼。当知是人是一切如来炽盛光明身。当知是人是不坏甲冑。当知是人能摧一切怨敌。当知是人能烧一切罪障。当知是人能净地狱趣。大梵云何得知。曾有苾刍心怀净信。如来制戒有所违犯不与取。现前僧物僧祇众物四方僧物将入已用。后遇重病受大苦恼。时彼苾刍无救济者。作大叫声。则于其处有一婆罗门优婆塞。闻其叫声即往诣彼病苾刍所。起大悲愍。即为书此随求大明王陀罗尼。系于颈下。苦恼皆息。便即命终生无间狱。其苾刍尸殡在塔中。其陀罗尼带于身上。因其苾刍才入地狱。诸受罪者所有苦痛。悉得停息咸皆安乐。阿鼻地狱所有猛火。由此陀罗尼威德力故悉皆消灭。是时焰魔卒见是事已。甚大惊怪。具以上事白琰魔王。说伽陀曰。

大王今当知。此事甚奇特。于大危险处。苦恼皆休息。
众生诸恶业。猛火聚消灭。锯解自停止。利刀不能割。
刀树及剑林。屠割等诸苦。镬汤余地狱。苦恼息皆除。
焰魔是法王。以法治有情。此因缘非小。为我除疑惑。
时彼焰魔王。从无悲狱卒。闻如此事已。而作如是言。
此事甚奇特。皆由业所感。汝往满足城。当观有何事。
狱卒受教已。于其夜分时。至满足城南。见彼苾刍塔。
乃见于尸上。带此大明王。随求陀罗尼。而放大光明。
其光如火聚。天龙及药叉。八部众围绕。恭敬而供养。
时彼焰魔卒。号为随求塔。

尔时焰魔卒还至王所。具以上事白焰魔王。其苾刍承此陀罗尼威力。罪障消灭得生三十三天。因号此天为先身随求天子。大梵当知此陀罗尼有大威力。汝当受持书写读诵依法佩带。常得远离一切苦恼一切恶趣。不被电雹伤害云何得知。大梵于形愚末坛城。有一长者名尾么罗商佉。其家巨富库藏盈溢。金银充满多饶财谷。于是长者身作商主。乘大船舶入海采宝。于大海中遇低弥鱼欲坏其船。海中龙王复生瞋怒。起大雷震哮吼掣电雨金刚雹。时诸商人见此雷雹。各怀忧恼生大恐怖。叫呼求救无救济者。时众商人前诣商主。悲声号哭白商主言。仁者当设何计救护我等令离忧怖。

尔时商主其心无畏。志性坚固有大智慧。见诸商人恐怖逼迫。而告之言。汝等商人勿怖勿怖生勇健心。我令汝等免斯怖畏。其诸商人心生勇健。复作是言。大商主唯愿速说除灾难法。令我等命皆得存济。于是商主即告商人言。我有大明王名随求陀罗尼。能降伏诸难调者有大神通。令汝解脱如此忧恼。即便书写此随求陀罗尼。安幢刹上其低弥鱼应时即见此船。光明赫奕如炽盛火。由此陀罗尼大威力智火。烧低弥鱼即便锁融。彼诸龙等见是相已。悉起慈心。从空而下广作供养。令此船舶直至宝洲。大梵此皆大智大明大随求。以一切如来神力之所加持。是故名为大明王。若有书写此陀罗尼安于幢刹。能息一切恶风雹雨非时寒热雷电霹雳。能息一切诸天斗诤言讼。能除一切蚊虻蝗虫及诸余类食苗稼者。悉当退散。一切应言利王爪者不能为害。一切苗稼花果药草悉皆增长其味香美柔软润滑。若其国内旱涝不调。由此陀罗尼威力。龙王欢喜雨泽及时。

复次。大梵。若有流布此大随求陀罗尼之处。是诸有情既知是已。当以上妙香花幢盖种种供养。应以殊胜缯彩。缠裹经夹安于塔中或置幢刹。以种种音乐歌咏赞叹。旋绕供养虔诚礼拜。彼等有情心所思惟。所希求愿皆得满足。若能依法书写。身上带持所求皆得。求男得男求女得女。怀胎安隐渐增圆满产生安乐。

大梵云何得知。往昔曾于摩伽陀国。有王名施愿手。以何因缘名施愿手。其王初生之时。即展其手执母奶嗍奶足已。由手触母奶。是其母奶变为金色。母奶增长自然流出。若有众人来乞求者。王舒右手有净信佛菩萨诸天。倾写种种诸妙珍宝。入王手中施求乞者。随其所须皆得满足。一切悉得安乐成就。以是因缘名施愿手。其王为求子故。供养诸佛及诸塔庙求子不得。王持斋戒广设无遮施会。大作福业护持三宝。修理未来破坏寺舍故。置一库藏。何以故大梵我念过去。于此摩伽陀国境俱尸那城大力士聚落多如来教法中。有一长者名曰法慧。于一切众生起大悲心。为诸有情说此大随求陀罗尼法要。当彼之时于长者家有一贫人。闻此妙法告长者子言。长者子我于汝家中作务常乐听法。我当供养此法。彼贫匮人于长者家营事复供养法。于过后时其长者子与一金钱。其人得已发菩提心。为拔济众生故以此福回施一切有情。所得金钱便将供养此大随求陀罗尼。作是愿言。以此舍施之福。愿一切有情断其贫匮之业。由此因缘其舍施福无有尽期。如是多种福因缘故。供养诸佛菩萨。由此福业。净居天子现于梦中而告王言。大王今可依法书写此随求陀罗尼令国大夫人斋戒带持。即有子息。其王觉已。召占相人及有智婆罗门众。择吉宿曜直日。依法斋戒书写此陀罗尼。令夫人带于颈下。复更供养窣睹波塔诸佛菩萨。广行舍施。应时有胎。日月满足产生一子。色相具足端严殊胜见者欢喜。大梵当知此是无能胜无碍大随求宝印心大明王陀罗尼威力故。一切如来之所供养。所求愿者皆得称心。

复告大梵。彼时法慧长者子家佣力贫人者。岂异人乎。施愿手王是也。由往昔舍一金钱。供养此大随求陀罗尼。回施一切有情。以是因缘其福无尽。于末后身复为国王。净信三宝心不退转。广行舍施成就檀波罗蜜。
普遍光明清净炽盛如意宝印心无能胜大明王大随求陀罗尼经卷上

天阿苏罗药叉等。来听法者应至心。
拥护佛法使长存。各各勤行世尊教。
诸有听徒来至此。或在地上或居空。
常于人世起慈心。日夜自身依法住。
愿诸世界常安乐。无边福智益群生。
所有罪业并消除。远离众苦归圆寂。
恒用戒香涂莹体。常持定服以资身。
菩提妙花遍庄严。随所住所常安乐。

普遍光明焰鬘清净炽盛如意宝印心无能胜大明王大随求陀罗尼经卷下
唐北天竺三藏沙门大广智不空奉诏译

复次大梵。其天帝释共阿苏罗斗战之时。帝释常以此陀罗尼。置于顶髻珠中带持。帝释天众不被伤损。而常得胜安隐还宫。初发心菩萨乃至究竟地菩萨。带持能离种种障难魔业故。若有人带此陀罗尼。一切如来之所加持。一切菩萨之所护念。一切人天国王王子大臣婆罗门长者。常恒恭敬礼拜承事。一切天龙阿苏罗蘗路茶紧那罗摩睺罗伽人非人等。皆供养彼带持者。彼等天龙八部皆言。彼人是大丈夫。如来复言彼善男子善女人。能摧一切魔障。离一切疾病。离一切灾横。除一切忧恼。恒为一切天龙之所守护。

佛告大梵。复有四陀罗尼。是无能胜妃大心真言。若有书写带佩于身。常应诵持深心思惟观行。能除恶梦不祥之事。一切安乐皆得成就。

唵。阿蜜哩多嚩㘑。嚩囉嚩囉。钵囉嚩囉尾戍第。吽吽。颇咤颇咤。娑嚩贺。

唵。阿蜜哩多。尾卢枳𩕳。蘖婆僧囉乞洒抳。阿羯哩洒抳。吽吽。颇咤颇咤。娑嚩贺。

唵。尾磨黎惹也嚩㘑。阿蜜哩帝。吽吽。吽吽。颇咤颇咤。颇咤颇咤。娑嚩贺。

唵。跛囉跛囉。三跛囉三跛囉。印捺囉也。尾戌驮𩕳。吽吽。噜左㘑。娑嚩贺。

才说此四大陀罗尼已。一切诸佛诸大菩萨声闻。异口同音说此大随求大明王无能胜陀罗尼甲冑密言句。以一切如来印印之。此甚难得闻。何况书写。受持读诵。为他宣说。是故当知是大佛事。如来深极赞叹说随喜者。极难得闻。此大随求大无能胜陀罗尼名。极难得闻极甚难得。能尽诸罪。大力勇健具大威德神力。能生无量功德。能摧一切魔众。能断一切习气聚及魔罗羂。能除他真言毒压祷药法相憎法降伏法。能令恶心众生起大慈心。能护爱乐供养佛菩萨圣众之人。能护书写受持读诵听闻大乘经典者。又能满足修佛菩提者。大梵持此大随求无能胜明王。不被沮坏。于一切处获大供养。如佛大师两足之尊。云何得知。此明王能摧一切诸魔。大梵过去有佛。号广博微笑面摩尼金宝光焰照曜高勇王如来应正觉。初成道时。往诣菩提场欲转法轮。一切如来称赞。尔时一切魔并无量俱胝那庾多眷属围绕。现种种形作可畏声。示种种魔境现作神通。雨种种器仗来往四方而作障难。

尔时广博微笑面摩尼金宝光焰照曜高勇王如来。于须臾顷寂然而住。意诵此大随求大明王无能胜大陀罗尼七遍。才诵此陀罗尼已。于刹那顷一切魔波旬。见彼如来一一毛孔。出无量俱胝百千那庾多金刚使者。身彼甲冑放大光明。各持刀剑钺斧羂索杖棒三戟叉。各出如是言。捉缚恶魔摧恶心者。斩断其命粉粹诸魔作如来障碍者。即彼一切难调恶魔。以如来大威力。于毛孔中出大丈夫。是诸魔众闷绝擗地。皆失自性神通辩才四散驰走。如来以大慈剑。得胜魔境。成无上菩提。即转一切如来法轮。如一切佛一切障者毘那夜迦。诸恶魔等。悉皆摧坏如来即转法轮。超越生死大海得到彼岸。如是大梵此陀罗尼。有大势力能获神通到于彼岸。若才忆念。于危险处皆得解脱。意乐清净恶心有情起大慈心。是故大梵常当忆念。如理作意依法书写而常带持。

复次。大梵乌禅那城有王。名曰梵施。彼有一人犯王重罪。王勅杀者一人领彼罪人将往山中令断其命。杀者受教领彼罪人。至于山窟将刀欲杀。是其罪人先于右臂。带此随求无能胜陀罗尼。心复忆念。由此大明威力。其刀光焰状如火聚。片片段坏犹如微尘。尔时。杀者见此事已。怪未曾有。即以上事具白于王。其王闻已便生大怒。复勅杀者将此罪人送药叉窟。于彼窟中有众多药叉。令食此罪人。受王勅已即领罪人送药叉窟。才送窟中时。药叉众欢喜踊跃奔走向前。欲食罪人。以彼罪人带大随求威德力故。时众药叉见彼罪人身上有大光明炽盛晃曜。诸药叉众悉皆惊怖。各作是念。此火欲来烧我。彼药叉众见是事已甚大惊怖。送此罪人安窟门外旋绕礼拜。

尔时使者具以上事复白于王其王闻已倍更瞋怒。又勅使者缚彼罪人掷深河中。奉教往掷。才入河中河便枯竭犹如陆地。时彼罪人便住于岸。所被系缚绳索片片断绝。王闻此事极大惊怪。熙怡微笑生大奇特。唤彼罪人问其所缘。汝何所解。罪人白言大王我无所解。我于身上唯带大随求无能胜大明王陀罗尼。王即赞言甚大奇特。此大明微妙能摧死罚。说伽陀曰。

大明甚微妙。能摧于死罚。诸佛所加持。拔济诸有情。
能解脱苦病。大明大威德。能脱非时死。大悲尊所说。
能止大疾病。速证大菩提。

尔时。彼王欢喜踊跃。即取彼随求供养礼拜。即以缯帛系罪人首与其灌顶册称为城主。如是大梵此大随求无能胜大陀罗尼。若有带者于一切处获大供养。若难调伏恶心众生。咸起慈心皆相顺伏。是故常带持此大陀罗尼。

复次。大梵若欲带此陀罗尼者。应择吉日吉宿吉祥之时。依法书此陀罗尼。时大梵王闻是语已。甚大欢喜。五轮著地顶礼佛足。而白佛言以何方法书写此大随求无能胜陀罗尼。

尔时如来即说伽陀。告大梵言。

大梵汝当知。我今为汝说。愍念诸有情。令得大安乐。
远离逼迫业。解脱诸疾病。妇人有胎孕。有情离贫匮。
穷业悉皆除。当于吉宿时。布沙宿相应。应当持斋戒。
而供养诸佛。发大菩提心。复生悲愍心。及起大慈心。
于他思利益。遍诸有情类。龙恼麝檀香。以此香汤浴。
著新净衣服。更以烧香熏。当用瞿摩夷。涂小曼荼罗。
应取五贤瓶。皆盛满香水。杂插诸花果。置于坛四角。
余一置坛中。花鬘及烧香。及与妙涂香。应烧五味香。
檀香飒毕迦。酥合沈石蜜。和合而烧之。种种诸妙花。
诸花果种子。随时而供养。涂香用严饰。酥蜜并奶酪。
𪍿麦及乳糜。盛满供养器。应量皆吉祥。以瓷瓦椀盛。
四角满香器。佉陀罗木橛。钉于坛四角。用五色缕缠。
于坛四角外。大梵以此仪。若求悉地者。应食三白食。
书此随求人。当于坛中坐。敷以净茅荐。依法而书写。
或素或缯帛。或用于桦皮。或叶或余物。写此陀罗尼。
女人求子息。当用牛黄书。中心画童子。璎珞庄严身。
满钵盛珍宝。左手而执持。坐在莲华上。其华而开敷。
又于西隅角。而画四宝山。其山金宝饰。殷勤应画此。
能令胎安隐。丈夫求子者。应用郁金书。彼所求之事。
悉皆得成就。于真言四面。应画种种印。又画于莲华。
或二或三四。乃至五莲华。其华悉开敷。八叶具鬓蕊。
华茎以缯系。华上画三戟。戟上复系缯。复画于钺斧。
亦在莲华上。又于白莲华。于上应画剑。复在莲华上。
而画于商佉。所画诸莲华。皆在宝池内。若丈夫带者。
不应画童子。应画天人形。种种宝庄严。帝王若带者。
于中应当画。观自在菩萨。又于其四面。画种种印契。
若是苾刍带。应画持金刚。右执金刚杵。左拳竪头指。
拟彼难调者。又当于四角。而画四天王。婆罗门带者。
画于伊舍那。刹利若带持。画摩酰首罗。毘舍若带者。
画于天帝释。或画毘沙门。若是首陀带。而画那罗延。
童男及童女。画波闍波提。青色女人带。画卢陀罗天。
女人白色者。应画名称天。女人若肥充。画彼宝贤将。
瘦女人带者。画满贤药叉。若怀妊妇人。应画大黑天。
或画梵天王。如是诸人类。各画本所尊。依法而书写。
常带于身上。所求悉如意。金铜作莲华。于上安宝珠。
如意火爓形。置在幢刹上。而于此珠内。安置大随求。
于是随求中。画彼邑城主。若是己舍宅。建此随求刹。
而画本家主。于随求四面。周匝画莲华。于华胎蕊上。
画于一羂索。金刚杵及轮。棒及烁讫底。如是诸契印。
各在莲华上。刹上悬缯幡。应如法供养。由此随求刹。
能护国城邑。及以护家族。灾祸悉除灭。疫病及诸疾。
饥馑不流行。他敌不相侵。国土皆安乐。若遇天亢旱。
并以滞雨时。应画九头龙。头上有宝珠。火焰而流出。
当于龙心上。画一金刚杵。于龙身四面。写此大随求。
置在于箧中。亦安幢刹上。应时降甘雨。滞雨即便睛。
商主领众人。或在于水陆。诸商人带者。应画商主形。
如前安刹上。离贼及诸怖。悉皆到彼岸。是故当殷勤。
带持及读诵。吉祥灭诸罪。若是念诵人。应画自本尊。
若日月荧惑。辰星及岁星。太白与镇星。彗及罗睺曜。
如是等九执。凌逼本命宿。所作诸灾祸。悉皆得解脱。
或有石女人。扇姹半姹迦。如是之人类。由带大随求。
尚能有子息。若此类带者。应画九执曜。二十八宿天。
中画彼人形。所求悉如意。如世尊所说。获得最胜处。
现世及他世。常获殊胜乐。三十三天宫。随意而所生。
悦意赡部洲。最胜族姓家。得生如是族。或生刹利天。
或婆罗门家。由带大随求。生此最胜处。书写持读诵。
依法而带之。得往安乐刹。莲华而化生。决定无疑惑。
一切诸如来。赞说斯功德。称扬不能尽。关闭地狱门。
能开诸天趣。安乐悉成就。智慧皆圆满。诸佛及菩萨。
常安慰其人。身常受快乐。骁勇有大力。如来诚言说。
当获转轮位。安慰人天众。惊怖恶心者。修此陀罗尼。
不久当获得。不被刀所伤。毒药反水火。悉皆不能害。
非命及夭寿。诸罪皆远离。见闻及触身。于一切时处。
鬼魅及斗诤。诸怖皆消灭。恶虫及毒蛇。囚闭悉解脱。
种种疾大病。悉皆尽除灭。由修持此明。于诸摩罗众。
无碍得通达。能于一切处。而获大供养。人中得最胜。
加护修真言。

修行菩萨随求大护大明王陀罗尼品第二
尔时世尊告大梵说伽他曰。

我今为宣说。修行持明者。说加护仪则。愍念诸有情。
由此拥护故。获得大成就。所居诸方处。用此作加持。
获得无障碍。决定心无疑。无怖无热恼。除灭一切魅。
随顺于宿曜。能断业钩锁。恶食恶跳蓦。厌书悉消灭。
一切诸怨家。不被凌逼伤。恶视及压祷。咒药并蛊毒。
于他敌险处。大怖怨敌处。一切悉消融。由大随求力。
诸佛皆拥护。一切智菩萨。悉皆作加护。缘觉及声闻。
及余多种类。大威德天龙。皆当而拥护。诵此密言者。
由才闻此故。明王最胜尊。一切处无畏。牟尼作是说。
恶梦及恶作。极恶诸逼迫。疾病以缠身。瘦病销骨肉。
及余多种病。丁疮诸毒肿。恶疰及灾祸。啮嚼诸有情。
为损有情故。大害极恐怖。悉皆得除灭。由加护大明。
以此明加护。合死得解脱。若以黑索羂。将至阎魔宫。
命复倍增寿。由书带大护。若有寿尽者。七日后当死。
才书带此明。无上大加护。或若才闻故。依法加持者。
处处获安隐。随意受安乐。六十八俱胝。一百那庾多。
三十三诸天。辅翼于帝释。来护于此人。随逐作加护。
四大护世王。金刚手大力。一百明族众。常加护彼人。
日天及月天。梵王与毘纽。自在夜摩天。宝贤及力天。
满贤大勇猛。诃利帝及子。半遮罗半支。俱摩罗众主。
吉祥大明妃。多闻及辩才。商弃尼华齿。一髻大威德。
如是大药叉。常当而拥护。石女生子息。胎孕咸增长。
常加护彼人。乃至寿命存。丈夫常得胜。恐怖斗战处。
由此满诸愿。由依净信天。诸罪悉消灭。由书此大明。
诸佛常观察。大威德菩萨。彼名称增长。福寿亦复然。
财谷皆丰盛。获得悉无疑。睡眠及觉悟。悉皆得安乐。
怨家及鬼神。皆不能沮坏。当于斗战时。常皆获得胜。
若修密言时。此护最为胜。安乐修诸明。悉得无障碍。
一切密言教。悉皆得成就。成入一切坛。速成三昧耶。
乃至于来世。诸佛皆委寄。由持此大护。诸吉祥皆满。
意愿悉成就。由才书此明。一切乐丰盛。安乐而舍寿。
必生于善趣。欲生极乐国。持带此明王。决定无疑惑。
斗诤于言讼。战阵大怖中。诸怖皆远离。如佛诚言说。
常获宿命智。生生皆无疑。国王皆欢喜。及后宫眷属。
尽皆常恭敬。常与善人和。皆悉生怜愍。并人及与天。
令彼作加护。常恒于昼夜。大护成就明。等正觉所说。

尔时薄伽婆即说随求大护明王大心陀罗尼曰。

曩谟母驮野。曩谟达磨野。娜莫僧驮伽野。曩谟婆誐嚩帝。舍枳也母曩曳。摩贺迦噜抳迦野。怛他蘖跢夜。囉贺帝三藐三母驮野。娜莫飒答毘药三藐三没第毘药。曀钐娜莫娑讫哩怛嚩。母驮舍娑曩物𠴊驮曳。阿贺阿娜𩕳寅。三钵囉嚩乞洒铭。萨嚩萨怛嚩弩剑跛夜。伊𤚥尾淰摩贺帝昝。摩贺么攞跛囉讫囉𤚥。拽暹婆史单么鼻怛囉琰。嚩日囉娑曩么𩕳史鼻。疙囉贺萨吠尾曩野迦。室制嚩怛得尾洒拏尾攞孕蘖跢。怛你也他。。拟哩拟哩拟哩抳。拟哩嚩底。麌拏嚩底。阿迦舍嚩底。阿迦舍囉第播跛尾誐帝。阿迦势誐誐曩怛黎。阿迦舍尾佐哩抳。入嚩里多失㘈。么抳穆讫底佉唧多冐里驮㘈。苏计势。苏嚩讫怛𭋸。苏宁怛𭋸。素袜囉拏冐里。阿底帝阿拏答半宁么曩蘖帝。钵囉底聿答半宁。曩莫萨吠钐母驮南。入嚩里多帝惹三母第。素母第。婆誐嚩底。素囉乞洒抳。素乞洒铭。素钵囉陛。素娜铭。素难帝。左𭋸。。婆誐嚩底。跋捺囉嚩底。跋捺𭋸。素跋捺𭋸。尾么黎惹野跋捺𭋸。钵囉赞拏赞腻。嚩日囉赞腻。摩贺赞腻。矫哩。巘驮哩。来里赞拏里。么蹬拟。卜羯斯舍嚩哩捺囉弭腻。劳捺哩抳。萨嚩囉他娑驮𩕳。贺曩贺曩。。萨嚩设咄噜喃诺贺诺贺。萨嚩讷瑟咤南。毕𭋸多比舍左拏枳𩕳南。么弩洒么弩洒喃。跛左跛左。纥哩乃阎尾陀网娑野尒尾耽。萨嚩讷瑟咤疙囉贺喃。曩舍野曩舍野。萨嚩播跛𩕳铭囉乞洒囉乞洒𤚥。萨嚩萨怛嚩难左。。萨嚩婆庾钵捺囉吠毘药。萨嚩讷瑟咤南满驮能矩噜。萨嚩枳里尾洒曩舍𩕳。沫多难腻么𩕳𩕳左黎底致底致𩕳。咄𪘨具囉抳味囉抳。钵囉袜囉三么𭋸。赞拏里。么蹬祇。袜拶嘶素噜卜羯斯舍嚩哩饷迦里捺囉尾腻。诺贺𩕳跛左𩕳沫娜𩕳。萨囉罗萨囉黎。萨囉揽陛呬曩。末地庾得讫哩瑟咤。。尾娜哩抳。尾驮哩抳。么呬里。么护么护里𩕳。萨奶𩕳萨拏伴霁。满帝满底𩕳。满帝斫讫囉嚩枳𩕳。惹黎祖黎。舍嚩哩舍么哩舍嚩哩。萨嚩弭野地贺囉抳。祖腻祖腻𩕳。𩕳弭𩕳弭。。𩕳泯驮哩底哩路迦惹贺𩕳。底哩路迦路迦羯哩。怛𡃤驮睹迦弭野嚩路枳𩕳。嚩日囉跛囉戍播舍渴誐斫讫囉底哩戍囉震跢么抳。么诃尾你野驮囉抳。囉乞洒囉乞洒𤚥么么萨嚩萨怛嚩难左。萨嚩怛囉萨嚩娑他曩蘖怛写。萨嚩讷瑟咤婆曳毘药。萨嚩么弩洒么弩洒婆曳毘药。萨嚩尾野地毘药。嚩日𭋹嚩日囉嚩底。嚩日囉播抳驮𭋹。呬里呬里。弭里弭里。唧里唧里。悉里悉里。嚩囉嚩囉嚩囉祢。萨嚩怛囉惹野腊第娑嚩贺。播跛尾娜囉抳。萨嚩弭野地贺囉抳娑嚩贺。萨嚩怛囉婆野贺囉抳娑嚩贺。娑嚩娑底婆嚩都么么（某甲）娑嚩贺。扇底娑嚩贺。补瑟置娑嚩贺。惹野都惹曳惹野嚩底。惹野尾补罗尾么黎娑嚩贺。萨嚩怛他蘖多地瑟姹曩布囉底娑嚩贺。唵步哩步哩嚩日囉嚩底。怛他蘖多纥哩乃野布囉抳散驮囉抳。末罗末罗惹野尾你曳吽吽癹咤癹咤娑嚩贺。

佛告大梵。若有人以如来身明陀罗尼句作加持救济摄受加护。能作息灾作吉祥法。遮止谪罚成大加护。若人寿命欲尽。诵此真言复得延命增寿。久久命存常获安乐得大念持。若以金刚杵才念诵加持。或有非命患大疾者。皆得解脱。一切疾病皆得除灭。长患病者诵此真言。加持袈裟角拂彼病人便即除差。日日诵持者。得大聪慧威力大勤勇辩才成就。一切罪障定受业报悉皆消灭。一切佛菩萨并天龙药叉等。于受持陀罗尼者。当令精气入身增加威力。身心常得喜悦。大梵此大明王大护陀罗尼。若有乃至傍生禽兽耳根所闻。彼等悉皆于无上菩提永不退转。何况净信善男子善女人。苾刍苾刍尼邬波索迦邬波斯迦。国王王子婆罗门刹利及诸余类。一闻此大随求大护陀罗尼。闻已深心净信恭敬书写读诵。生殷重心修习。为他广演流布。大梵悉皆远离八种非命。彼人身中不生疾病。不被火毒刀杖蛊毒压祷咒诅诸恶药法之所损害。不被身痛头痛。及诸疟病一日二日三日四日乃至七日。及癫痫病悉不能为患。正念睡眠正念觉悟。证大涅槃。现世得大富贵自在。所生之处于彼彼处常得宿命。一切人天皆悉爱敬容仪端正。一切地狱饿鬼傍生皆得解脱。犹如日轮以光明照曜一切有情。譬如月轮以甘露灌洒一切有情身。得适悦其人。以法甘露遍入一切有情心相续中。皆令滋泽欢喜。一切诸恶药叉罗刹。步多。毕㘑多。毕舍遮。癫痫鬼。拏枳宁诸魅。毘那也迦等悉皆以此大随求大护威力不能侵恼。若来逼近。忆念此大护明王。则一切恶心之类。于持诵之人发生欢喜受教而去。由此大随求大护明王威力。终无怨敌怖畏。是诸怨敌不能凌突。或若有人于国王大臣婆罗门长者处。所犯愆过罪合当死杀者。持刀剑临刑之时。若才忆念此大护明王。其刀片片断坏犹如微尘。其人当彼之时。得悟一切法平等。获大念力。尔时如来说伽陀曰。

此大护加持。清净灭诸罪。能作慧吉祥。增长诸功德。
能满诸吉庆。除灭不吉祥。能见妙好梦。能净诸恶梦。
此大明大护。护丈夫女人。旷野及险怖。刹那得解脱。
获诸所欲愿。如正等觉说。若行失道路。念此大明王。
速疾得正道。得殊胜饮食。以身口意业。先时作诸罪。
所作不善业。才忆此明故。悉皆得消灭。书写及受持。
转读并念诵。及为他宣说。诸法皆通达。如是得法味。
诸罪即消灭。心意所乐求。诸事皆成就。一切死怖中。
毕获而救护。王官及水火。霜雹并劫贼。斗战及言讼。
利牙爪兽难。一切悉消融。由诵洛叉遍。速成就此明。
一切诸佛说。称诵令欢喜。满菩提资粮。一切所住处。
若用此大明。而作于加持。欲作诸事业。自他利益事。
任运得成就。以大护无疑。大梵汝当知。我今复宣说。
为患重病人。应作四方坛。瞿摩和土泥。用五色粉画。
而作曼荼罗。四瓶安四角。智者依仪轨。坛上散诸花。
应烧殊胜香。及种种饮食。人见令净信。如是用香花。
依法而奉献。四角插四箭。用五色缕缠。令病者澡浴。
身著清净衣。遍体而涂香。引入坛中心。面对东方坐。
尔时持明者。先诵此大明。令满于七遍。自加持己身。
次诵三七遍。加持于病者。由诵此大护。诸疾皆息除。
即取一水瓶。盛香花饮食。七遍作加护。东方远弃掷。
次取南方瓶。花香食如教。准前诵七遍。远弃掷南方。
次用西方瓶。花香及饮食。依前加持法。北方亦复然。
尔时持诵者。仰面向上方。诵此明一遍。成最胜加持。
大梵作是已。一切苦悉除。如是加持法。释师子所说。
一切诸法中。无有能与比。三界中胜护。彼人无夭死。
无老亦无病。怨憎离别苦。若能在理观。心离于忧苦。
及离受蕴苦。阎魔众供养。阎魔之法王。恭敬而承事。
告彼持明者。速往于天趣。由此大明故。地狱尽无余。
则乘妙宫殿。具威至天上。一切人及天。药叉罗刹众。
悉皆而供养。常当获此福。是故常受持。金刚手菩萨。
秘密药叉将。帝释舍脂后。诃利帝母众。半支迦药叉。
护世大威德。日月及星宿。执曜猛恶者。一切大龙王。
诸天并仙众。阿苏罗及龙。金翅乾闼婆。紧那摩睺罗。
由书带此明。恒常而随逐。由依法诵持。获得大荣盛。

尔时世尊说是经已。诸大菩萨大声闻众。及梵天王一切天龙药叉阿苏罗乾闼婆蘖路茶紧那罗摩呼罗伽人非人等。皆大欢喜信受奉行。
普遍光明清净炽盛如意宝印心无能胜大明王大随求陀罗尼经卷下

天阿苏罗药叉等。来听法者应至心。
拥护佛法使长存。各各勤行世尊教。
诸有听徒来至此。或在地上或居空。
常于人世起慈心。日夜自身依法住。
愿诸世界常安隐。无边福智益群生。
所有罪业并消除。远离众苦归圆寂。
恒用戒香涂莹体。常持定服以资身。
菩提妙花遍庄严。随所住处常安乐。

回向偈
抄经功德殊胜行。无边胜福皆回向。
普愿沉溺诸众生。速往无量光佛刹。
十方三世一切佛。一切菩萨摩诃萨。
摩诃般若波罗蜜。

回向偈
愿以此功德。庄严佛净土。
上报四重恩。下济三途苦。
若有见闻者。悉发菩提心。
尽此一报身。同生极乐国。

大正藏 第 20 册 No. 1153 普遍光明清净炽盛如意宝印心无能胜大明王大随求陀罗尼经

`
});