// sutras/dsznfj-s.js

registerSutra("dsznfj-s", {
  title: "楞严经大势至菩萨念佛圆通章",
  displayTitle: "念佛圆通章（简体）",
  abbr: "dsznfj",
  category: "ddsznfj",
  lang: "简体",
  volume: "全本",

  content: `大势至菩萨念佛圆通章

净三业真言
唵。娑嚩婆嚩秫驮。娑嚩达摩。娑嚩婆嚩秫度憾。

南无本师释迦牟尼佛
南无本师释迦牟尼佛
南无本师释迦牟尼佛

开经偈
无上甚深微妙法。百千万劫难遭遇。
我今见闻得受持。愿解如来真实义。

楞严经大勢至菩薩念佛圓通章
唐天竺沙门般剌蜜帝译

法王子与其同伦五十二菩萨即从座起。顶礼佛足而白佛言。我忆往昔恒河沙劫。有佛出世名无量光。十二如来相继一劫。其最后佛名超日月光。彼佛教我念佛三昧。譬如有人。一专为忆一人专忘。如是二人若逢不逢或见非见。二人相忆二忆念深。如是乃至从生至生。同于形影不相乖异。十方如来怜念众生如母忆子。若子逃逝虽忆何为。子若忆母如母忆时。母子历生不相违远。若众生心忆佛念佛。现前当来必定见佛去佛不远。不假方便自得心开。如染香人身有香气。此则名曰香光庄严。我本因地以念佛心入无生忍。今于此界摄念佛人归于净土。佛问圆通。我无选择。都摄六根。净念相继得三摩地斯为第一。
恭录大佛顶万行首楞严经卷第五

回向偈
抄经功德殊胜行。无边胜福皆回向。
普愿沉溺诸众生。速往无量光佛刹。
十方三世一切佛。一切菩萨摩诃萨。
摩诃般若波罗蜜。

回向偈
愿以此功德。庄严佛净土。
上报四重恩。下济三途苦。
若有见闻者。悉发菩提心。
尽此一报身。同生极乐国。

大正藏第 19 册 No. 0945 大佛顶如来密因修证了义诸菩萨万行首楞严经

`
});