// sutras/dsznfj-t.js

registerSutra("dsznfj-t", {
  title: "楞嚴經大勢至菩薩念佛圓通章",
  displayTitle: "念佛圓通章（繁體）",
  abbr: "dsznfj",
  category: "ddsznfj",
  lang: "繁體",
  volume: "全本",

  content: `大勢至菩薩念佛圓通章

淨三業真言
唵。娑嚩婆嚩秫馱。娑嚩達摩。娑嚩婆嚩秫度憾。

南無本師釋迦牟尼佛
南無本師釋迦牟尼佛
南無本師釋迦牟尼佛

開經偈
無上甚深微妙法。百千萬劫難遭遇。
我今見聞得受持。願解如來真實義。

楞嚴經大勢至菩薩念佛圓通章
唐天竺沙門般剌蜜帝譯

法王子與其同倫五十二菩薩即從座起。頂禮佛足而白佛言。我憶往昔恒河沙劫。有佛出世名無量光。十二如來相繼一劫。其最後佛名超日月光。彼佛教我念佛三昧。譬如有人。一專為憶一人專忘。如是二人若逢不逢或見非見。二人相憶二憶念深。如是乃至從生至生。同於形影不相乖異。十方如來憐念眾生如母憶子。若子逃逝雖憶何為。子若憶母如母憶時。母子曆生不相違遠。若眾生心憶佛念佛。現前當來必定見佛去佛不遠。不假方便自得心開。如染香人身有香氣。此則名曰香光莊嚴。我本因地以念佛心入無生忍。今於此界攝念佛人歸於淨土。佛問圓通。我無選擇。都攝六根。淨念相繼得三摩地斯為第一。
恭錄大佛頂萬行首楞嚴經卷第五

回向偈
抄經功德殊勝行。無邊勝福皆回向。
普願沉溺諸眾生。速往無量光佛刹。
十方三世一切佛。一切菩薩摩訶薩。
摩訶般若波羅蜜。

回向偈
願以此功德。莊嚴佛淨土。
上報四重恩。下濟三途苦。
若有見聞者。悉發菩提心。
盡此一報身。同生極樂國。

大正藏第 19 冊 No. 0945 大佛頂如來密因修證了義諸菩薩萬行首楞嚴經

`
});