// sutras/fmenj-t.js

registerSutra("fmenj-t", {
  title: "佛說父母恩難報經",
  displayTitle: "父母恩難報經（繁體）",
  abbr: "fmenj",
  category: "ffmenj",
  lang: "繁體",
  volume: "全本",

  content: `佛說父母恩難報經

淨三業真言
唵。娑嚩婆嚩秫馱。娑嚩達摩。娑嚩婆嚩秫度憾。

南無本師釋迦牟尼佛
南無本師釋迦牟尼佛
南無本師釋迦牟尼佛

開經偈
無上甚深微妙法。百千萬劫難遭遇。
我今見聞得受持。願解如來真實義。

佛說父母恩難報經
後漢安息國三藏安世高譯

聞如是。
一時婆伽婆在舍衛城祇樹給孤獨園。

爾時世尊告諸比丘。父母於子。有大增益。乳餔長養。隨時將育。四大得成。右肩負父。左肩負母。經歷千年。正使便利背上。然無有怨心於父母。此子猶不足報父母恩。若父母無信。教令信。獲安隱處。無戒。與戒教授獲安隱處。不聞。使聞教授。獲安隱處。慳貪。教令好施。勸樂教授。獲安隱處。無智慧。教令黠慧。勸樂教授。獲安隱處。如是信如來。至真。等正覺。明行成為。善逝。世間解。無上士。道法禦。天人師。號佛。世尊教。信法教授。獲安隱處。諸法甚深。現身獲果。義味甚深。如是智者。明通此行。教令信聖眾。如來聖眾甚清淨。行直不曲。常和合。法法成就。戒成就。三昧成就。智慧成就。解脫成就。解脫見慧成就。所謂聖眾。四雙八輩。是謂如來聖眾。最尊最貴。當尊奉敬仰。是世間無上福田。如是諸子。當教父母行慈。諸比丘有二子。所生子。所養子。是謂比丘有二子。是故諸比丘。當學所生子。口出法味。如是諸比丘當作是學。

爾時諸比丘聞佛所說。歡喜奉行。
佛說父母恩難報經

回向偈
抄經功德殊勝行。無邊勝福皆回向。
普願沉溺諸眾生。速往無量光佛刹。
十方三世一切佛。一切菩薩摩訶薩。
摩訶般若波羅蜜。

回向偈
願以此功德。莊嚴佛淨土。
上報四重恩。下濟三途苦。
若有見聞者。悉發菩提心。
盡此一報身。同生極樂國。

大正藏第 16 冊 No. 0684 佛說父母恩難報經

`
});