// sutras/fmenj-s.js

registerSutra("fmenj-s", {
  title: "佛说父母恩难报经",
  displayTitle: "父母恩难报经（简体）",
  abbr: "fmenj",
  category: "ffmenj",
  lang: "简体",
  volume: "全本",

  content: `佛说父母恩难报经

净三业真言
唵。娑嚩婆嚩秫驮。娑嚩达摩。娑嚩婆嚩秫度憾。

南无本师释迦牟尼佛
南无本师释迦牟尼佛
南无本师释迦牟尼佛

开经偈
无上甚深微妙法。百千万劫难遭遇。
我今见闻得受持。愿解如来真实义。

佛说父母恩难报经
后汉安息国三藏安世高译

闻如是。
一时婆伽婆在舍卫城祇树给孤独园。

尔时世尊告诸比丘。父母于子。有大增益。乳餔长养。随时将育。四大得成。右肩负父。左肩负母。经历千年。正使便利背上。然无有怨心于父母。此子犹不足报父母恩。若父母无信。教令信。获安隐处。无戒。与戒教授获安隐处。不闻。使闻教授。获安隐处。悭贪。教令好施。劝乐教授。获安隐处。无智慧。教令黠慧。劝乐教授。获安隐处。如是信如来。至真。等正觉。明行成为。善逝。世间解。无上士。道法御。天人师。号佛。世尊教。信法教授。获安隐处。诸法甚深。现身获果。义味甚深。如是智者。明通此行。教令信圣众。如来圣众甚清净。行直不曲。常和合。法法成就。戒成就。三昧成就。智慧成就。解脱成就。解脱见慧成就。所谓圣众。四双八辈。是谓如来圣众。最尊最贵。当尊奉敬仰。是世间无上福田。如是诸子。当教父母行慈。诸比丘有二子。所生子。所养子。是谓比丘有二子。是故诸比丘。当学所生子。口出法味。如是诸比丘当作是学。

尔时诸比丘闻佛所说。欢喜奉行。
佛说父母恩难报经

回向偈
抄经功德殊胜行。无边胜福皆回向。
普愿沉溺诸众生。速往无量光佛刹。
十方三世一切佛。一切菩萨摩诃萨。
摩诃般若波罗蜜。

回向偈
愿以此功德。庄严佛净土。
上报四重恩。下济三途苦。
若有见闻者。悉发菩提心。
尽此一报身。同生极乐国。

大正藏第 16 册 No. 0684 佛说父母恩难报经

`
});