// sutras/xwbftgdj-t.js

registerSutra("xwbftgdj-t", {
  title: "顯無邊佛土功德經",
  displayTitle: "顯無邊佛土功德經（繁體）",
  abbr: "xwbftgdj",
  category: "xxwbftgdj",
  lang: "繁體",
  volume: "全本",

  content: `顯無邊佛土功德經

淨三業真言
唵。娑嚩婆嚩秫馱。娑嚩達摩。娑嚩婆嚩秫度憾。

南無本師釋迦牟尼佛
南無本師釋迦牟尼佛
南無本師釋迦牟尼佛

開經偈
無上甚深微妙法。百千萬劫難遭遇。
我今見聞得受持。願解如來真實義。

顯無邊佛土功德經
大唐三藏法師玄奘譯

如是我聞。一時薄伽梵在摩揭陀國閑寂法林。坐妙菩提金剛堅固無量妙寶共所莊嚴紅蓮華臺師子座上。與十不可說俱胝那庾多百千佛土極微塵數大菩薩俱。及諸天。人。阿素洛等無量大眾前後圍繞。

爾時。會中有一菩薩摩訶薩。名不可思議光王。承佛威神從坐而起。頂禮佛足。合掌恭敬而白佛言。世尊。諸佛國土時分莊嚴。有勝劣不。

佛言。善男子。我此索訶世界釋迦牟尼佛土一劫。於極樂世界無量光佛土為一晝夜。極樂世界一劫。於袈裟幢世界金剛堅固歡喜佛土為一晝夜。袈裟幢世界一劫。於不退輪音世界極妙圓滿紅蓮敷身佛土為一晝夜。不退輪音世界一劫。於絕塵世界法幢佛土為一晝夜。絕塵世界一劫。於明燈世界師子佛土為一晝夜。明燈世界一劫。於妙光世界遍照佛土為一晝夜。妙光世界一劫。於難超世界身放法光佛土為一晝夜。難超世界一劫。於莊嚴世界一切神通慧光王佛土為一晝夜。莊嚴世界一劫。於鏡輪世界月覺佛土為一晝夜。

善男子。如是世界展轉漸增。滿十不可說俱胝那庾多百千佛土極微塵數世界佛土最後世界佛土一劫。於蓮華德世界賢德佛土為一晝夜。於彼世界諸菩薩眾修治殊勝普賢行地。善男子。如諸世界晝夜漸增。如是諸佛壽量身相。菩薩世界莊嚴亦爾。由彼有情福轉增故。

若有善男子。善女人聞此顯示無邊佛土功德法門。歡喜信重。受持。讀誦。如理思惟。廣為他說。臨命終時。十方佛土無量諸佛皆現其前。慰喻讚美。令其增進無量善根。隨願往生諸佛淨國。乃至無上正等菩提。於生生中常憶宿命。修菩薩行速得圓滿。

時薄伽梵說此經已。不可思議光王菩薩摩訶薩並諸天。人。阿素洛等一切眾會。聞佛所說。皆大歡喜。信受奉行。
顯無邊佛土功德經

回向偈
抄經功德殊勝行。無邊勝福皆回向。
普願沉溺諸眾生。速往無量光佛刹。
十方三世一切佛。一切菩薩摩訶薩。
摩訶般若波羅蜜。

回向偈
願以此功德。莊嚴佛淨土。
上報四重恩。下濟三途苦。
若有見聞者。悉發菩提心。
盡此一報身。同生極樂國。

大正藏第 10 冊 No. 0289 顯無邊佛土功德經

`
});